# dotfiles necessities
brew "stow"
cask "font-jetbrains-mono-nerd-font"

# Productivity
cask "raycast"
cask "vscodium"
cask "zen"
cask "obsidian"
cask "claude-code"

# Terminal
cask "ghostty"
brew "oh-my-posh"
brew "fzf"
brew "bat"
brew "eza"
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"
brew "fd"
brew "lazygit"